OpenFOAMcases/NACA/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (5.908847 0 1.041889);

boundaryField
{

    "(inlet|outlet)"
    {
      type            freestreamVelocity;
      freestreamValue $internalField;
    }

    wing
    {
        type            noSlip;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
