OpenFOAMcases/NACA/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    back
    {
        type            empty;
        nFaces          57344;
        startFace       114208;
    }
    front
    {
        type            empty;
        nFaces          57344;
        startFace       171552;
    }
    inlet
    {
        type            patch;
        nFaces          448;
        startFace       228896;
    }
    outlet
    {
        type            patch;
        nFaces          256;
        startFace       229344;
    }
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          256;
        startFace       229600;
    }
)

// ************************************************************************* //
